2020-10-26-access-nas-drive-using-windows10-pin-login.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-26 Tue 23:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Access NAS drive using Windows10 PIN login</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Peter Tillemans">
<link rel="stylesheet" href="css/site.css"
  type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="nav">
<ul>
<li><a href="/">Home</a></li>
<li><a href="https://github.com/ptillemans">GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<header>
<h1 class="title">Access NAS drive using Windows10 PIN login</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf25c5d6">1. Attempt 1</a></li>
<li><a href="#orgc287435">2. Attempt 2 : remap network drives on login</a>
<ul>
<li><a href="#orgc91ae10">2.1. *%ProgramData%\Microsoft\Windows\Start Menu\Programs\StartUp\MapDrives.cmd</a></li>
<li><a href="#orgcc37b5b">2.2. %SystemDrive%\Scripts\MapDrives.ps1</a></li>
<li><a href="#orgbe9c3f2">2.3. Evaluation</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Each time I login using the PIN of my Microsoft account, my mounted folders on the NAS are not mounted. After login I get a notification that not all mounted drives could be connected.  When double clicking on the failed mount I get a silly error regarding duplicate sessions or something, and I can access after logging in.
</p>

<p>
This is irritating, but also breaks automations like auto importing notes and documents into evernote from the NAS folder.
</p>


<div id="outline-container-orgf25c5d6" class="outline-2">
<h2 id="orgf25c5d6"><span class="section-number-2">1</span> Attempt 1</h2>
<div class="outline-text-2" id="text-1">
<p>
This seems to be a known issue with PIN (and by extension face recognition (?)) login.
</p>

<p>
On Windows answers I found a <a href="https://answers.microsoft.com/en-us/windows/forum/all/unable-to-access-nas-drive-when-logged-in-using/3587cf33-7ed9-403f-ac7c-d4158969412d">workaround</a> :
</p>

<ul class="org-ul">
<li>Open the <b>Credential Manager</b></li>
<li>Select <b>Windows Credential</b></li>
<li><b>Add a Windows Credential</b> (it will actually modify the existing one)</li>
<li>network address : \\ <span class="underline">your NAS</span></li>
<li>User name : <span class="underline">your NAS</span>\pti</li>
<li>Password : <span class="underline">your password on the NAS</span></li>
</ul>

<p>
From now on your drive should be mounted after rebooting.
</p>

<p>
Unfortunately, it does not.
</p>

<p>
Removing and adding again does not help either.
</p>
</div>
</div>

<div id="outline-container-orgc287435" class="outline-2">
<h2 id="orgc287435"><span class="section-number-2">2</span> Attempt 2 : remap network drives on login</h2>
<div class="outline-text-2" id="text-2">
<p>
In 2018 <a href="https://support.microsoft.com/en-us/help/4471218/mapped-network-drive-may-fail-to-reconnect-in-windows-10-version-1809#:~:text=Workaround%201:%20Create%20a%20startup%20item&amp;text=If%20the%20device%20has%20not,t%20automatically%20reconnect%20network%20drives.&amp;text=A%20log%20file%20(StartupLog.,to%20open%20the%20mapped%20drives.">another workaround</a> was published.
</p>

<p>
This relies on a powershell script launched by a Command script to walk over
unavailable mapped drives and map them again.
</p>

<p>
It uses 2 scripts:
</p>
</div>

<div id="outline-container-orgc91ae10" class="outline-3">
<h3 id="orgc91ae10"><span class="section-number-3">2.1</span> *%ProgramData%\Microsoft\Windows\Start Menu\Programs\StartUp\MapDrives.cmd</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A startup scrip to kickoff remapping after login
</p>

<div class="org-src-container">
<pre class="src src-shell">PowerShell -Command <span style="font-style: italic;">"Set-ExecutionPolicy -Scope CurrentUser Unrestricted"</span> &gt;&gt; <span style="font-style: italic;">"%TEMP%\StartupLog.txt"</span> 2&gt;&amp;1
PowerShell -File <span style="font-style: italic;">"%SystemDrive%\Scripts\MapDrives.ps1"</span> &gt;&gt; <span style="font-style: italic;">"%TEMP%\StartupLog.txt"</span> 2&gt;&amp;1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc37b5b" class="outline-3">
<h3 id="orgcc37b5b"><span class="section-number-3">2.2</span> %SystemDrive%\Scripts\MapDrives.ps1</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-shell">$<span style="font-weight: bold; font-style: italic;">i</span>=3
<span style="font-weight: bold;">while</span>($<span style="font-weight: bold; font-style: italic;">True</span>){
    $<span style="font-weight: bold; font-style: italic;">error</span>.clear()
    $<span style="font-weight: bold; font-style: italic;">MappedDrives</span> = Get-SmbMapping |where -property Status -Value Unavailable -EQ | select LocalPath,RemotePath
    foreach( $<span style="font-weight: bold; font-style: italic;">MappedDrive</span><span style="font-weight: bold;"> in</span> $<span style="font-weight: bold; font-style: italic;">MappedDrives</span>)
    {
        try {
            New-SmbMapping -LocalPath $<span style="font-weight: bold; font-style: italic;">MappedDrive</span>.LocalPath -RemotePath $<span style="font-weight: bold; font-style: italic;">MappedDrive</span>.RemotePath -Persistent $<span style="font-weight: bold; font-style: italic;">True</span>
        } catch {
            Write-Host <span style="font-style: italic;">"There was an error mapping $MappedDrive.RemotePath to $MappedDrive.LocalPath"</span>
        }
    }
    $<span style="font-weight: bold; font-style: italic;">i</span> = $<span style="font-weight: bold; font-style: italic;">i</span> - 1
    <span style="font-weight: bold;">if</span>($<span style="font-weight: bold; font-style: italic;">error</span>.Count -eq 0 -Or $<span style="font-weight: bold; font-style: italic;">i</span> -eq 0) {<span style="font-weight: bold;">break</span>}

    Start-Sleep -Seconds 30

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe9c3f2" class="outline-3">
<h3 id="orgbe9c3f2"><span class="section-number-3">2.3</span> Evaluation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
After rebooting and logging in, I still get the error that not all drives could be mounted, however, by the time I can check in the explorer the volume is mounted and ready to be used.
</p>

<p>
Not very elegant as the notification still feels terribly yanky, but at least it no longer interferes my workflows.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer"> Copyright 2020 Peter Tillemans (<a href="http://validator.w3.org/check?uri=referer">Validate</a>
  HTML).<br> Last updated 2021-01-26 Tue 23:09.<br> Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9).  </div>
</div>
</body>
</html>
